# Parsing
SCRAPING_REFUSED_URLS = \
    [('Азиоптик Краплі очні розчин.',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Азиоптик Краплі очні розчин.».\n'
      'Що робити?'),
     ('Азиоптик Ромфарм краплі оч., р-н 15 мг/г (250 мг) №6 у конт. однодоз',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Азиоптик Ромфарм краплі оч., р-н 15 мг/г (250 мг) №6 у конт. '
      'однодоз».\n'
      'Що робити?'),
     ('Актифед - Розчин для перорального застосування',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Актифед - Розчин для перорального застосування».\n'
      'Що робити?'),
     ('Актифед - Сироп',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Актифед - Сироп».\n'
      'Що робити?'),
     ('Актифед - Таблетки',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Актифед - Таблетки».\n'
      'Що робити?'),
     ('Бронхоплант Ілан Фарм сироп ісландського моху по 200 мл у флак.',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Бронхоплант Ілан Фарм сироп ісландського моху по 200 мл у '
      'флак.».\n'
      'Що робити?'),
     ('Глікодин сироп по 50 мл у флак.',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Глікодин сироп по 50 мл у флак.».\n'
      'Що робити?'),
     ('Ефізол таблетки д/смок. №20',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Ефізол таблетки д/смок. №20».\n'
      'Що робити?'),
     ('Кодепсин таблетки №10',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Кодепсин таблетки №10».\n'
      'Що робити?'),
     ('Кодесан IC таблетки №10',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Кодесан IC таблетки №10».\n'
      'Що робити?'),
     ('Кодетерп Н таблетки №10',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Кодетерп Н таблетки №10».\n'
      'Що робити?'),
     ('Кодетерп таблетки №10',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Кодетерп таблетки №10».\n'
      'Що робити?'),
     ('Кодтерпін IC таблетки №10',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Кодтерпін IC таблетки №10».\n'
      'Що робити?'),
     ('Сангвірітрин розчин д/зовн. заст. 0.2 % по 50 мл у флак.',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Сангвірітрин розчин д/зовн. заст. 0.2 % по 50 мл у флак.».\n'
      'Що робити?'),
     ('Себідин таблетки д/розсмок. №20',
      'https://apteka911.ua/ua',
      'Швидкий пошук не дав результатів\n'
      'за запитом «Себідин таблетки д/розсмок. №20».\n'
      'Що робити?'),
     ('Септолете тотал лимон та мед льодяники по 3 мг/1 мг №16 (8х2)',
      'https://apteka911.ua/ua/shop/search?query=%D0%A1%D0%B5%D0%BF%D1%82%D0%BE%D0%BB%D0%B5%D1%82%D0%B5%20%D1%82%D0%BE%D1%82%D0%B0%D0%BB%20%D0%BB%D0%B8%D0%BC%D0%BE%D0%BD%20%D1%82%D0%B0%20%D0%BC%D0%B5%D0%B4%20%D0%BB%D1%8C%D0%BE%D0%B4%D1%8F%D0%BD%D0%B8%D0%BA%D0%B8%20%D0%BF%D0%BE%203%20%D0%BC%D0%B3%2F1%20%D0%BC%D0%B3%20%E2%84%9616%20(8%D1%852)',
      'Не найден ни один подходящий url')]

# Parsing
PARSING_REFUSED_URLS = \
    [('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malyutka-2-molochna-dlya-harchuvannya-ditey-z-6-do-12-misyatsiv-podalshegoduvannya-350-g-new-p41843',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-nestle-nestle-nestozhen-2-z-laktobakteriyami-l-reuteri-z-6-misyatsiv-1000-g-p138466',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-dityacha-malyatko-5-l-p1173',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malyutka-premium-1-molochna-z-prebiotikami-ta-nukleotidami-350-g-new-p41797',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-nutrilon-nutrilon-komfort-2-pri-kolikah-ta-zakrepah-vid-6-do-12-misyatsiv-300-g-p73285',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-karapuz-dlya-prigotuvannya-dityachogo-harchuvannya-5-l-p255361',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malish-na-molochno-zernoviy-osnovi-z-kukurudzyanim-boroshnom-350-g-new-p68417',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Аква Маріс сіль морська №30 у пак.-саше',
      'https://apteka911.ua/ua/shop/akva-maris-sistema-oroshuvannya-nosa-i-morska-sil-zbagachena-travami-paket-sashe-30-sht-p31878',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-dityacha-malyatko-sport-sport-0-33-l-p4361',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-dityacha-malyatko-0-33-l-p4218',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malish-na-molochno-zernoviy-osnovi-z-risovim-kukurudzyanim-vivsyanim-ta-grechanim-boroshnom-350-g-p241816',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-dityacha-malyatko-1-5-l-p1172',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-nutrilon-nutrilon-komfort-1-pri-kolikah-ta-zakrepah-vid-0-do-6-misyatsiv-600-g-p73282',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-hipp-hipp-combiotic-1-kombiotik-z-narodzhennya-900-g-p133789',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-nutritsiya-nutrilon-nutrilon-bezlaktozniy-dlya-ditey-neperenosimistyu-laktozi-z-narodzhennya-400-g-p882',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-nestle-nestle-nan-4-premium-optipro-premium-optipro-z-18-misyatsiv-800-g-p121690',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-dityacha-artezianska-negazovana-roganska-rosti-ditinka-sport-0-5l-p41749',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malyutka-premium-3-molochna-z-prebiotikami-ta-nukleotidami-350-g-new-p41799',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-nestle-nestle-nestozhen-1-z-laktobakteriyami-l-reuteri-z-narodzhennya-600-g-p139561',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-dityacha-artezianska-negazovana-roganska-ditinka-5l-p41546',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malish-na-molochno-zernoviy-osnovi-z-risovim-boroshnom-350-g-new-p41795',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-nestle-nestle-nan-1-premium-optipro-premium-optipro-z-narodzhennya-400-g-p2777',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-nestle-nestle-nan-3-premium-optipro-premium-optipro-z-12-misyatsiv-800-g-p9015',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-kuyalnik-tonus-kisen-1-5-l-p12786',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-nutrilon-nutrilon-komfort-1-pri-kolikah-ta-zakrepah-vid-0-do-6-misyatsiv-300-g-p73279',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-akva-layf-5-l-p70618',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-morshinka-dityacha-negazovana-6-l-p79594',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-morshinka-dityacha-negazovana-sport-0-33-l-p79597',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-nestle-nestle-nestozhen-4-z-laktobakteriyami-l-reuteri-z-18-misyatsiv-600-g-p140311',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-dityacha-artezianska-negazovana-roganska-ditinka-3l-p41545',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-nestle-nestle-nan-bezlaktozniy-dlya-ditey-z-diareeyu-i-neperenosimistyu-laktozi-z-narodzhennya-400-g-p1548',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malyutka-3-molochna-dlya-harchuvannya-ditey-z-12-misyatsiv-350-g-new-p41844',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-nestle-nestle-nan-1-premium-optipro-premium-optipro-z-narodzhennya-800-g-p5109',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-butilovana-malish-v-pet-plyashkah-5l-p41263',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malish-na-molochno-zernoviy-osnovi-zgrechanim-boroshnom-350-g-new-p41794',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-nestle-nestle-nestozhen-1-z-laktobakteriyami-l-reuteri-z-narodzhennya-1000-g-p138463',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-nestle-nestle-nestozhen-3-z-laktobakteriyami-l-reuteri-z-12-misyatsiv-600-g-p139816',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-mineralna-pitna-likuvalna-donat-mg-donat-ob-em-1-l-p30235',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-molochna-dityacha-nestle-nestle-nestozhen-3-z-laktobakteriyami-l-reuteri-z-12-misyatsiv-1000-g-p247822',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Вода питна РЕО д/мед. цілей слабогаз. по 950 мл у пляш. поліет.',
      'https://apteka911.ua/ua/shop/voda-pitna-kuyalnik-tonus-kisen-0-5-l-p12787',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malyutka-1-molochna-dlya-harchuvannya-ditey-z-narodzhennya-do-6-ti-misyatsiv-pochatkova-350-g-new-p41842',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malish-na-molochno-zernoviy-osnovi-z-vivsyanim-boroshnom-350-g-new-p41796',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'"),
     ('Суміш регідратаційна Humana Elektrolyt з фенхелем для дітей з народження, '
      'старших дітей і дорослих, 6.25 г',
      'https://apteka911.ua/ua/shop/sumish-suha-dityacha-horol-malish-na-molochno-zernoviy-osnovi-zgrechanim-i-vivsyanim-boroshnom-350-g-p133582',
      "Не найдено 'Особливості застосування' или 'Спосіб застосування' или "
      "'Застосування'")]

CORRECTED_UNUSED_DRUGS = \
    ['Ермуцин - порошок для оральної суспензії.',
     'Ермуцин порошок для оральної суспензії.',
     'Азиоптик Краплі очні розчин.',
     'Азиоптик Ромфарм краплі оч., р-н 15 мг/г (250 мг) №6 у конт. однодоз',
     'Азитер Краплі очні розчин.',
     'АзитроСандоз - Порошок для оральної суспензії.',
     'Азитросандоз - порошок для приготування суспензії 100 мг/5 мл 20 мл',
     'Актифед - Розчин для перорального застосування',
     'Актифед - Сироп',
     'Актифед - Таблетки',
     'Бронхоплант Ілан Фарм сироп ісландського моху по 200 мл у флак.',
     'Глікодин сироп по 50 мл у флак.',
     'Ефералган для дітей',
     'Ефізол таблетки д/смок. №20',
     'Кодепсин таблетки №10',
     'Кодесан IC таблетки №10',
     'Кодетерп Н таблетки №10',
     'Кодетерп таблетки №10',
     'Кодтерпін IC таблетки №10',
     'Окомістин - Краплі вушні',
     'Окомістин - Краплі назальні',
     'Окомістин - Краплі очні',
     'Окомістин - розчин',
     'Офтамірин - Краплі вушні',
     'Офтамірин - Краплі назальні',
     'Офтамірин - Краплі очні',
     'Офтамірин - розчин',
     'Парацетамол для дітей',
     'Преднізолон - таблетки.',
     'Сангвірітрин розчин д/зовн. заст. 0.2 % по 50 мл у флак.',
     'Себідин таблетки д/розсмок. №20',
     'Септолете тотал лимон та мед льодяники по 3 мг/1 мг №16 (8х2)',
     'Суспрін розчин д/ор. заст. 4 мг/5 мл по 50 мл у флак',
     'Цефма - Порошок для оральної суспензії.',
     'Цефподоксим - Порошок для оральної суспензії.',
     'Цефподоксим - Таблетки ( 100 мг)']

PARSING_UNUSED_DRUGS = \
    ['Азиоптик Краплі очні розчин.',
     'Азиоптик Ромфарм краплі оч., р-н 15 мг/г (250 мг) №6 у конт. однодоз',
     'Актифед - Розчин для перорального застосування',
     'Актифед - Сироп',
     'Актифед - Таблетки',
     'Бронхоплант Ілан Фарм сироп ісландського моху по 200 мл у флак.',
     'Глікодин сироп по 50 мл у флак.',
     'Ефізол таблетки д/смок. №20',
     'Кодепсин таблетки №10',
     'Кодесан IC таблетки №10',
     'Кодетерп Н таблетки №10',
     'Кодетерп таблетки №10',
     'Кодтерпін IC таблетки №10',
     'Сангвірітрин розчин д/зовн. заст. 0.2 % по 50 мл у флак.',
     'Себідин таблетки д/розсмок. №20']

if __name__ == "__main__":
    import pprint

    print(f"{len(CORRECTED_UNUSED_DRUGS)=}")
    print(f"{len(PARSING_UNUSED_DRUGS)=}")
    print("=" * 120)

    replacer_dict = dict()
    for corr, uncorr in zip(CORRECTED_UNUSED_DRUGS, PARSING_UNUSED_DRUGS):
        if not corr == uncorr:
            print(f"{uncorr} ===> {corr}")
            replacer_dict[uncorr] = corr

    pprint.pprint(replacer_dict)
